Repository: Landers52/election_system
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Election System
es: Sistema Elecciones

source: Welcome
es: Bienvenido

source: Logout
es: Cerrar sesión

source: Welcome to the Main Dashboard
es: Bienvenido al Panel Principal

source: Voting Progress
es: Progreso de votos

source: 0 voted
es: 0 votaron

source: 0 total voters
es: 0 votantes en total

source: No voters have been registered yet. Please upload a voter list to begin.
es: No se han registrado votantes todavía. Por favor suba una lista para comenzar.

source: Choose file
es: Elegir archivo

source: No file selected
es: Ningún archivo seleccionado

source: Upload Voter List
es: Subir lista de votantes

source: Voters already exist in the system. Do you want to replace them with the new list?
es: Ya existen votantes en el sistema. ¿Quiere reemplazarlos con la nueva lista?

source: Yes, Replace
es: Si, Reemplazar

source: No, Cancel
es: No, Cancelar

source: Search by DNI
es: Buscar por DNI

source: Search
es: Buscar

source: Please enter a DNI to search.
es: Por favor ingrese un DNI para buscar

source: Voted
es: Votó

source: Not Voted
es: No votó

source: Unmark
es: Desmarcar

source: Mark Voted
es: Marcar

source: Name:
es: Nombre:

source: Status:
es: Estado:

source: No voter found with that ID
es: No se encontró ningún votante con ese DNI

source: An error occurred during the search.
es: Ocurrió un error durante la búsqueda

source: %(n)s voted
es: %(n)s votaron

source: %(n)s total voters
es: %(n)s votantes en total

source: An error occurred while updating status.
es: Ocurrió un error al actualizar el estado

source: An error occurred while processing the request.
es: Ocurrió un error al procesar la solicitud

source: Welcome to the Visitor Dashboard
es: Bienvenido al Panel de Visitante

source: No voter found with that DNI.
es: No se encontró ningún votante con ese DNI

source: An error occurred while searching for the voter.
es: Ocurrió un error al buscar el votante

source: Action requires login or CSRF token.
es: La acción requiere inicio de sesión o token CSRF

source: Please upload an Excel (.xlsx) file.
es: Por favor suba un archivo Excel (.xlsx)

source: The uploaded Excel file is empty.
es: El archivo Excel está vacío

source: Excel file must contain 'dni' and 'name' columns.
es: El archivo excel debe contener columnas 'DNI' y 'Nombre'

source: Existing voters deleted.
es: Votantes existentes borrados

source: Error deleting existing voters: {error}
es: Error borrando votantes existentes: {error}

source: Voters imported successfully!
es: Votantes importados con éxito!

source: Error: Duplicate DNI found. Ensure DNIs are unique within the file and confirm replacement if necessary.
es: Error: DNI duplicado. Asegúrese que los DNIs sean únicos

source: Error processing the Excel file: {error}
es: Error procesando el archivo Excel: {error}
